# Laboratorio 4

------------

María Marta Ramirez Gil  21342                                   
Gustavo Andrés Gonzalez Pineda 21438  
Diego Leiva
Jose Pablo Orellana

Inteligencia Artificial                                                   
Universidad del Valle de Guatemala

------------

# Task 2.1

### Lectura y Limpieza de Datos

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler

Leer los datos

In [2]:
df = pd.read_csv("bank_transactions.csv", sep=",")

In [3]:
n = int(input("ingrese el numero de rows:"))
df.head(n)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.00
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.00
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.00
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.00
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.50
5,T6,C1536588,8/10/72,F,ITANAGAR,53609.20,2/8/16,173940,676.00
6,T7,C7126560,26/1/92,F,MUMBAI,973.46,2/8/16,173806,566.00
7,T8,C1220223,27/1/82,M,MUMBAI,95075.54,2/8/16,170537,148.00
8,T9,C8536061,19/4/88,F,GURGAON,14906.96,2/8/16,192825,833.00
9,T10,C6638934,22/6/84,M,MUMBAI,4279.22,2/8/16,192446,289.11

Informacion del dataset

In [4]:
tipos_de_datos = df.dtypes
print(tipos_de_datos)

TransactionID               object
CustomerID                  object
CustomerDOB                 object
CustGender                  object
CustLocation                object
CustAccountBalance         float64
TransactionDate             object
TransactionTime              int64
TransactionAmount (INR)    float64
dtype: object

In [5]:
df.duplicated().sum()

0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048567 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1048567 non-null  object
 1   CustomerID               1048567 non-null  object
 2   CustomerDOB              1045170 non-null  object
 3   CustGender               1047467 non-null  object
 4   CustLocation             1048416 non-null  object
 5   CustAccountBalance       1046198 non-null  float64
 6   TransactionDate          1048567 non-null  object
 7   TransactionTime          1048567 non-null  int64
 8   TransactionAmount (INR)  1048567 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 72.0+ MB

Nulos

In [7]:
print(df.isnull().sum())

TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64

Conteo de valores únicos en variables categóricas

In [8]:
print(df['CustGender'].value_counts())
print(df['CustLocation'].value_counts())

CustGender
M    765530
F    281936
T         1
Name: count, dtype: int64
CustLocation
MUMBAI                         103595
NEW DELHI                       84928
BANGALORE                       81555
GURGAON                         73818
DELHI                           71019
                                ...
ROAD (E) THANE                      1
TO APOLO PHARMACY BANGALORE         1
PILLAR NO 725 NEW DELHI             1
COMPANY BANGALORE                   1
IMPERIA THANE WEST                  1
Name: count, Length: 9355, dtype: int64

Encoding CustGender

In [9]:
# Encoding Para CustGender 1 si es mujer y 0 si es hombre
df['CustGender'] = df['CustGender'].map({'F': 1, 'M': 0})
df.head(10)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,1.0,JAMSHEDPUR,17819.05,2/8/16,143207,25.00
1,T2,C2142763,4/4/57,0.0,JHAJJAR,2270.69,2/8/16,141858,27999.00
2,T3,C4417068,26/11/96,1.0,MUMBAI,17874.44,2/8/16,142712,459.00
3,T4,C5342380,14/9/73,1.0,MUMBAI,866503.21,2/8/16,142714,2060.00
4,T5,C9031234,24/3/88,1.0,NAVI MUMBAI,6714.43,2/8/16,181156,1762.50
5,T6,C1536588,8/10/72,1.0,ITANAGAR,53609.20,2/8/16,173940,676.00
6,T7,C7126560,26/1/92,1.0,MUMBAI,973.46,2/8/16,173806,566.00
7,T8,C1220223,27/1/82,0.0,MUMBAI,95075.54,2/8/16,170537,148.00
8,T9,C8536061,19/4/88,1.0,GURGAON,14906.96,2/8/16,192825,833.00
9,T10,C6638934,22/6/84,0.0,MUMBAI,4279.22,2/8/16,192446,289.11

a int

In [10]:
df['CustGender'].fillna(0, inplace=True)
df['CustGender'] = df['CustGender'].astype(int)

df.head(10)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,1,JAMSHEDPUR,17819.05,2/8/16,143207,25.00
1,T2,C2142763,4/4/57,0,JHAJJAR,2270.69,2/8/16,141858,27999.00
2,T3,C4417068,26/11/96,1,MUMBAI,17874.44,2/8/16,142712,459.00
3,T4,C5342380,14/9/73,1,MUMBAI,866503.21,2/8/16,142714,2060.00
4,T5,C9031234,24/3/88,1,NAVI MUMBAI,6714.43,2/8/16,181156,1762.50
5,T6,C1536588,8/10/72,1,ITANAGAR,53609.20,2/8/16,173940,676.00
6,T7,C7126560,26/1/92,1,MUMBAI,973.46,2/8/16,173806,566.00
7,T8,C1220223,27/1/82,0,MUMBAI,95075.54,2/8/16,170537,148.00
8,T9,C8536061,19/4/88,1,GURGAON,14906.96,2/8/16,192825,833.00
9,T10,C6638934,22/6/84,0,MUMBAI,4279.22,2/8/16,192446,289.11

Encoding CustLocation

In [11]:
# Calcular frecuencia de cada ubicación
location_freq = df['CustLocation'].value_counts(normalize=True)

# Mapear la frecuencia de cada ubicación al dataset
df['CustLocation_FreqEncoded'] = df['CustLocation'].map(location_freq)

# Eliminar la columna original de CustLocation si ya no es necesaria
df.drop(columns=['CustLocation'], inplace=True)

# Verificar el cambio
print(df.head())

  TransactionID CustomerID CustomerDOB  CustGender  CustAccountBalance  \
0            T1   C5841053     10/1/94           1            17819.05
1            T2   C2142763      4/4/57           0             2270.69
2            T3   C4417068    26/11/96           1            17874.44
3            T4   C5342380     14/9/73           1           866503.21
4            T5   C9031234     24/3/88           1             6714.43

  TransactionDate  TransactionTime  TransactionAmount (INR)  \
0          2/8/16           143207                     25.0
1          2/8/16           141858                  27999.0
2          2/8/16           142712                    459.0
3          2/8/16           142714                   2060.0
4          2/8/16           181156                   1762.5

   CustLocation_FreqEncoded
0                  0.001509
1                  0.000822
2                  0.098811
3                  0.098811
4                  0.012476

In [12]:
df.head(10)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustLocation_FreqEncoded
0,T1,C5841053,10/1/94,1,17819.05,2/8/16,143207,25.00,0.001509
1,T2,C2142763,4/4/57,0,2270.69,2/8/16,141858,27999.00,0.000822
2,T3,C4417068,26/11/96,1,17874.44,2/8/16,142712,459.00,0.098811
3,T4,C5342380,14/9/73,1,866503.21,2/8/16,142714,2060.00,0.098811
4,T5,C9031234,24/3/88,1,6714.43,2/8/16,181156,1762.50,0.012476
5,T6,C1536588,8/10/72,1,53609.20,2/8/16,173940,676.00,0.000199
6,T7,C7126560,26/1/92,1,973.46,2/8/16,173806,566.00,0.098811
7,T8,C1220223,27/1/82,0,95075.54,2/8/16,170537,148.00,0.098811
8,T9,C8536061,19/4/88,1,14906.96,2/8/16,192825,833.00,0.070409
9,T10,C6638934,22/6/84,0,4279.22,2/8/16,192446,289.11,0.098811

In [13]:
print(df['CustGender'].value_counts())
print(df['CustLocation_FreqEncoded'].value_counts())

CustGender
0    766631
1    281936
Name: count, dtype: int64
CustLocation_FreqEncoded
0.098811    103595
0.081006     84928
0.077789     81555
0.070409     73818
0.067739     71019
             ...
0.000113       118
0.000105       110
0.000104       109
0.000092        96
0.000080        84
Name: count, Length: 471, dtype: int64

### Balanceo

In [14]:
class_distribution = df['CustGender'].value_counts()
print(class_distribution)

CustGender
0    766631
1    281936
Name: count, dtype: int64

En este caso aunque los datos se vean desbalanceados, no importa para nuestro algoritmo a que K-means no se ve afectado por el desequilibrio en la distribución de los datos de la misma manera que otros algoritmos de aprendizaje supervisado, como la clasificación.

### Escalar Variables
Se escalaran las varibles CustAccountBalance, TransactionTime, y TransactionAmount (INR)

In [15]:
# Lista de columnas a escalar
columnas_a_escalar = ['CustAccountBalance', 'TransactionTime', 'TransactionAmount (INR)']

# Crear un MinMaxScaler
scaler = MinMaxScaler()

# Aplicar el escalado solo a las columnas seleccionadas
df[columnas_a_escalar] = scaler.fit_transform(df[columnas_a_escalar])

In [16]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustLocation_FreqEncoded
0,T1,C5841053,10/1/94,1,0.000155,2/8/16,0.606915,0.000016,0.001509
1,T2,C2142763,4/4/57,0,0.000020,2/8/16,0.601198,0.017948,0.000822
2,T3,C4417068,26/11/96,1,0.000155,2/8/16,0.604817,0.000294,0.098811
3,T4,C5342380,14/9/73,1,0.007532,2/8/16,0.604825,0.001320,0.098811
4,T5,C9031234,24/3/88,1,0.000058,2/8/16,0.767744,0.001130,0.012476

### Eleccion de Variables

Para este algoritmo de K-means se usaran las variables 'CustGender', 'CustAccountBalance', 'TransactionTime', 'ransactionAmount (INR)' y 'CustLocation_FreqEncoded'.

Revision de Nulos

In [17]:
df.isnull().sum()

TransactionID                  0
CustomerID                     0
CustomerDOB                 3397
CustGender                     0
CustAccountBalance          2369
TransactionDate                0
TransactionTime                0
TransactionAmount (INR)        0
CustLocation_FreqEncoded     151
dtype: int64

In [18]:
df = df.dropna()

In [19]:
df.dtypes

TransactionID                object
CustomerID                   object
CustomerDOB                  object
CustGender                    int32
CustAccountBalance          float64
TransactionDate              object
TransactionTime             float64
TransactionAmount (INR)     float64
CustLocation_FreqEncoded    float64
dtype: object

Quitar las Columnas que no fueron elegidas para tener un dataset mas limpio

In [20]:
df = df.drop(['TransactionID', 'CustomerID', 'CustomerDOB', 'TransactionDate'], axis = 1)

In [21]:
df.head()

,CustGender,CustAccountBalance,TransactionTime,TransactionAmount (INR),CustLocation_FreqEncoded
0,1,0.000155,0.606915,0.000016,0.001509
1,0,0.000020,0.601198,0.017948,0.000822
2,1,0.000155,0.604817,0.000294,0.098811
3,1,0.007532,0.604825,0.001320,0.098811
4,1,0.000058,0.767744,0.001130,0.012476

# Implementacion del Modelo K-Means